{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"input_17:0": {"name": "input_17:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "input_17", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/model_28/lambda_15/mul/y", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_28/lambda_14/sub/y", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/model_28/conv2d_176/Conv2D__2", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_21", "op": "Const", "input": ["^input_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_22", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "48"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_23", "op": "Const", "input": ["^input_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "input": ["^input_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_12", "op": "Const", "input": ["^input_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_13", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_14", "op": "Const", "input": ["^input_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_15", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_16", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_28/tf_op_layer_Minimum_13/Minimum_13/y", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/input/_17", "op": "Const", "input": ["^input_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_18", "op": "Const", "input": ["^input_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_28/tf_op_layer_Maximum_13/Maximum_13/y", "op": "Const", "input": ["^input_17"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_19", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^input_17"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_28/lambda_14/sub", "op": "Sub", "input": ["input_17", "StatefulPartitionedCall/model_28/lambda_14/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_28/conv2d_176/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_28/lambda_14/sub", "Func/StatefulPartitionedCall/input/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/model_28/conv2d_176/Conv2D__2", "Func/StatefulPartitionedCall/input/_3"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_28/conv2d_177/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_28/conv2d_176/BiasAdd", "Func/StatefulPartitionedCall/input/_4", "Func/StatefulPartitionedCall/input/_5"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_28/conv2d_178/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_28/conv2d_177/Relu", "Func/StatefulPartitionedCall/input/_6", "Func/StatefulPartitionedCall/input/_7"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_28/add_80/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_28/conv2d_176/BiasAdd", "StatefulPartitionedCall/model_28/conv2d_178/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_28/conv2d_179/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_28/add_80/add", "Func/StatefulPartitionedCall/input/_8", "Func/StatefulPartitionedCall/input/_9"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_28/conv2d_180/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_28/conv2d_179/Relu", "Func/StatefulPartitionedCall/input/_10", "Func/StatefulPartitionedCall/input/_11"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_28/add_81/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_28/add_80/add", "StatefulPartitionedCall/model_28/conv2d_180/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_28/conv2d_181/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_28/add_81/add", "Func/StatefulPartitionedCall/input/_12", "Func/StatefulPartitionedCall/input/_13"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_28/conv2d_182/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_28/conv2d_181/Relu", "Func/StatefulPartitionedCall/input/_14", "Func/StatefulPartitionedCall/input/_15"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/model_28/add_82/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_28/add_81/add", "StatefulPartitionedCall/model_28/conv2d_182/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_28/conv2d_183/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_28/add_82/add", "Func/StatefulPartitionedCall/input/_16", "Func/StatefulPartitionedCall/input/_17"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model_28/conv2d_184/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_28/conv2d_183/Relu", "Func/StatefulPartitionedCall/input/_18", "Func/StatefulPartitionedCall/input/_19"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/model_28/add_83/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_28/add_82/add", "StatefulPartitionedCall/model_28/conv2d_184/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_28/conv2d_185/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_28/add_83/add", "Func/StatefulPartitionedCall/input/_20", "Func/StatefulPartitionedCall/input/_21"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_28/add_84/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_28/conv2d_176/BiasAdd", "StatefulPartitionedCall/model_28/conv2d_185/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_28/conv2d_186/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_28/add_84/add", "Func/StatefulPartitionedCall/input/_22", "Func/StatefulPartitionedCall/input/_23"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_28/tf_op_layer_DepthToSpace_13/DepthToSpace_13", "op": "DepthToSpace", "input": ["StatefulPartitionedCall/model_28/conv2d_186/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "block_size": {"i": "4"}, "_cloned": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_28/lambda_15/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_28/lambda_15/mul/y", "StatefulPartitionedCall/model_28/tf_op_layer_DepthToSpace_13/DepthToSpace_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_28/lambda_15/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_28/lambda_14/sub/y", "StatefulPartitionedCall/model_28/lambda_15/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_28/tf_op_layer_Minimum_13/Minimum_13", "op": "Minimum", "input": ["StatefulPartitionedCall/model_28/lambda_15/add", "StatefulPartitionedCall/model_28/tf_op_layer_Minimum_13/Minimum_13/y"], "attr": {"_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_28/tf_op_layer_Maximum_13/Maximum_13", "op": "Maximum", "input": ["StatefulPartitionedCall/model_28/tf_op_layer_Minimum_13/Minimum_13", "StatefulPartitionedCall/model_28/tf_op_layer_Maximum_13/Maximum_13/y"], "attr": {"T": {"type": "DT_FLOAT"}, "_cloned": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_28/tf_op_layer_Maximum_13/Maximum_13"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_28/lambda_15/mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_28/lambda_14/sub/y", "shape": [3], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/ArithmeticOptimizer/FoldMultiplyIntoConv_scaled_StatefulPartitionedCall/model_28/conv2d_176/Conv2D__2", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_21", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_5", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_6", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_22", "shape": [3, 3, 64, 48], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_7", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_9", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_23", "shape": [48], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_10", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_11", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_12", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_13", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_14", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_15", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_16", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_28/tf_op_layer_Minimum_13/Minimum_13/y", "shape": [], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_17", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_18", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_28/tf_op_layer_Maximum_13/Maximum_13/y", "shape": [], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_19", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_20", "shape": [3, 3, 64, 64], "dtype": "float32"}]}]}