{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_20", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_12"}, "name": "input_12", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AHQAGABkARsAUwApAk5nAAAAAADgX0ApAdoIcmdi\nX21lYW4pAdoBeqkAcgMAAAD6HzxpcHl0aG9uLWlucHV0LTMxLTgyNDQ3ODlmNDAwZD7aCDxsYW1i\nZGE+DAAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_6", "inbound_nodes": [[["input_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_121", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_121", "inbound_nodes": [[["lambda_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_122", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_122", "inbound_nodes": [[["conv2d_121", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_123", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_123", "inbound_nodes": [[["conv2d_122", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_55", "trainable": true, "dtype": "float32"}, "name": "add_55", "inbound_nodes": [[["conv2d_121", 0, 0, {}], ["conv2d_123", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_124", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_124", "inbound_nodes": [[["add_55", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_125", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_125", "inbound_nodes": [[["conv2d_124", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_56", "trainable": true, "dtype": "float32"}, "name": "add_56", "inbound_nodes": [[["add_55", 0, 0, {}], ["conv2d_125", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_126", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_126", "inbound_nodes": [[["add_56", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_127", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_127", "inbound_nodes": [[["conv2d_126", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_57", "trainable": true, "dtype": "float32"}, "name": "add_57", "inbound_nodes": [[["add_56", 0, 0, {}], ["conv2d_127", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_128", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_128", "inbound_nodes": [[["add_57", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_129", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_129", "inbound_nodes": [[["conv2d_128", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_58", "trainable": true, "dtype": "float32"}, "name": "add_58", "inbound_nodes": [[["add_57", 0, 0, {}], ["conv2d_129", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_130", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_130", "inbound_nodes": [[["add_58", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_59", "trainable": true, "dtype": "float32"}, "name": "add_59", "inbound_nodes": [[["conv2d_121", 0, 0, {}], ["conv2d_130", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_131", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_131", "inbound_nodes": [[["add_59", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "DepthToSpace_8", "trainable": true, "dtype": "float32", "node_def": {"name": "DepthToSpace_8", "op": "DepthToSpace", "input": ["conv2d_131/Identity"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "block_size": {"i": "4"}}}, "constants": {}}, "name": "tf_op_layer_DepthToSpace_8", "inbound_nodes": [[["conv2d_131", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AGQBFAB0ABcAUwApAk5nAAAAAADgX0ApAdoIcmdi\nX21lYW4pAdoBeqkAcgMAAAD6HzxpcHl0aG9uLWlucHV0LTMxLTgyNDQ3ODlmNDAwZD7aCDxsYW1i\nZGE+FwAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_7", "inbound_nodes": [[["tf_op_layer_DepthToSpace_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Minimum_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Minimum_9", "op": "Minimum", "input": ["lambda_7/Identity", "Minimum_9/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 255.0}}, "name": "tf_op_layer_Minimum_9", "inbound_nodes": [[["lambda_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Maximum_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Maximum_9", "op": "Maximum", "input": ["Minimum_9", "Maximum_9/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.0}}, "name": "tf_op_layer_Maximum_9", "inbound_nodes": [[["tf_op_layer_Minimum_9", 0, 0, {}]]]}], "input_layers": [["input_12", 0, 0]], "output_layers": [["tf_op_layer_Maximum_9", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_121/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv2d_121/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_122/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_122/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_123/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_123/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_124/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_124/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_125/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_125/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_126/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_126/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_127/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_127/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_128/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_128/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_129/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_129/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_130/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_130/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_131/kernel", "shape": [3, 3, 64, 48], "dtype": "float32"}, {"name": "conv2d_131/bias", "shape": [48], "dtype": "float32"}]}]}