{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_7", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float16", "sparse": false, "ragged": false, "name": "input_5"}, "name": "input_5", "inbound_nodes": []}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_3", "trainable": true, "dtype": "float16", "node_def": {"name": "Sub_3", "op": "Sub", "input": ["input_5", "Sub_3/y"], "attr": {"T": {"type": "DT_HALF"}}}, "constants": {"1": [114.4375, 111.4375, 103.0]}}, "name": "tf_op_layer_Sub_3", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "RealDiv_3", "trainable": true, "dtype": "float16", "node_def": {"name": "RealDiv_3", "op": "RealDiv", "input": ["Sub_3", "RealDiv_3/y"], "attr": {"T": {"type": "DT_HALF"}}}, "constants": {"1": 127.5}}, "name": "tf_op_layer_RealDiv_3", "inbound_nodes": [[["tf_op_layer_Sub_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_44", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_44", "inbound_nodes": [[["tf_op_layer_RealDiv_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_45", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_45", "inbound_nodes": [[["conv2d_44", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_46", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_46", "inbound_nodes": [[["conv2d_45", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_20", "trainable": true, "dtype": "float16"}, "name": "add_20", "inbound_nodes": [[["conv2d_44", 0, 0, {}], ["conv2d_46", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_47", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_47", "inbound_nodes": [[["add_20", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_48", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_48", "inbound_nodes": [[["conv2d_47", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_21", "trainable": true, "dtype": "float16"}, "name": "add_21", "inbound_nodes": [[["add_20", 0, 0, {}], ["conv2d_48", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_49", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_49", "inbound_nodes": [[["add_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_50", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_50", "inbound_nodes": [[["conv2d_49", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_22", "trainable": true, "dtype": "float16"}, "name": "add_22", "inbound_nodes": [[["add_21", 0, 0, {}], ["conv2d_50", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_51", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_51", "inbound_nodes": [[["add_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_52", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_52", "inbound_nodes": [[["conv2d_51", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_23", "trainable": true, "dtype": "float16"}, "name": "add_23", "inbound_nodes": [[["add_22", 0, 0, {}], ["conv2d_52", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_53", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_53", "inbound_nodes": [[["add_23", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_24", "trainable": true, "dtype": "float16"}, "name": "add_24", "inbound_nodes": [[["conv2d_44", 0, 0, {}], ["conv2d_53", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_54", "trainable": true, "dtype": "float16", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_54", "inbound_nodes": [[["add_24", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "DepthToSpace_1", "trainable": true, "dtype": "float16", "node_def": {"name": "DepthToSpace_1", "op": "DepthToSpace", "input": ["conv2d_54/Identity"], "attr": {"data_format": {"s": "TkhXQw=="}, "block_size": {"i": "4"}, "T": {"type": "DT_HALF"}}}, "constants": {}}, "name": "tf_op_layer_DepthToSpace_1", "inbound_nodes": [[["conv2d_54", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_1", "trainable": true, "dtype": "float16", "node_def": {"name": "Mul_1", "op": "Mul", "input": ["DepthToSpace_1", "Mul_1/y"], "attr": {"T": {"type": "DT_HALF"}}}, "constants": {"1": 127.5}}, "name": "tf_op_layer_Mul_1", "inbound_nodes": [[["tf_op_layer_DepthToSpace_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_1", "trainable": true, "dtype": "float16", "node_def": {"name": "AddV2_1", "op": "AddV2", "input": ["Mul_1", "AddV2_1/y"], "attr": {"T": {"type": "DT_HALF"}}}, "constants": {"1": [114.4375, 111.4375, 103.0]}}, "name": "tf_op_layer_AddV2_1", "inbound_nodes": [[["tf_op_layer_Mul_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Minimum_3", "trainable": true, "dtype": "float16", "node_def": {"name": "Minimum_3", "op": "Minimum", "input": ["AddV2_1", "Minimum_3/y"], "attr": {"T": {"type": "DT_HALF"}}}, "constants": {"1": 255.0}}, "name": "tf_op_layer_Minimum_3", "inbound_nodes": [[["tf_op_layer_AddV2_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Maximum_3", "trainable": true, "dtype": "float16", "node_def": {"name": "Maximum_3", "op": "Maximum", "input": ["Minimum_3", "Maximum_3/y"], "attr": {"T": {"type": "DT_HALF"}}}, "constants": {"1": 0.0}}, "name": "tf_op_layer_Maximum_3", "inbound_nodes": [[["tf_op_layer_Minimum_3", 0, 0, {}]]]}], "input_layers": [["input_5", 0, 0]], "output_layers": [["tf_op_layer_Maximum_3", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_44/kernel", "shape": [3, 3, 3, 64], "dtype": "float16"}, {"name": "conv2d_44/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_45/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_45/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_46/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_46/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_47/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_47/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_48/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_48/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_49/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_49/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_50/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_50/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_51/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_51/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_52/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_52/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_53/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_53/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_54/kernel", "shape": [3, 3, 64, 48], "dtype": "float16"}, {"name": "conv2d_54/bias", "shape": [48], "dtype": "float16"}]}]}