{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_14", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_9"}, "name": "input_9", "inbound_nodes": []}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_7", "op": "Sub", "input": ["input_9", "Sub_7/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [114.44400024414062, 111.46050262451172, 103.0199966430664]}}, "name": "tf_op_layer_Sub_7", "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "RealDiv_7", "trainable": true, "dtype": "float32", "node_def": {"name": "RealDiv_7", "op": "RealDiv", "input": ["Sub_7", "RealDiv_7/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 127.5}}, "name": "tf_op_layer_RealDiv_7", "inbound_nodes": [[["tf_op_layer_Sub_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_88", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_88", "inbound_nodes": [[["tf_op_layer_RealDiv_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_89", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_89", "inbound_nodes": [[["conv2d_88", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_90", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_90", "inbound_nodes": [[["conv2d_89", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_40", "trainable": true, "dtype": "float32"}, "name": "add_40", "inbound_nodes": [[["conv2d_88", 0, 0, {}], ["conv2d_90", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_91", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_91", "inbound_nodes": [[["add_40", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_92", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_92", "inbound_nodes": [[["conv2d_91", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_41", "trainable": true, "dtype": "float32"}, "name": "add_41", "inbound_nodes": [[["add_40", 0, 0, {}], ["conv2d_92", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_93", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_93", "inbound_nodes": [[["add_41", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_94", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_94", "inbound_nodes": [[["conv2d_93", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_42", "trainable": true, "dtype": "float32"}, "name": "add_42", "inbound_nodes": [[["add_41", 0, 0, {}], ["conv2d_94", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_95", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_95", "inbound_nodes": [[["add_42", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_96", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_96", "inbound_nodes": [[["conv2d_95", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_43", "trainable": true, "dtype": "float32"}, "name": "add_43", "inbound_nodes": [[["add_42", 0, 0, {}], ["conv2d_96", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_97", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_97", "inbound_nodes": [[["add_43", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_44", "trainable": true, "dtype": "float32"}, "name": "add_44", "inbound_nodes": [[["conv2d_88", 0, 0, {}], ["conv2d_97", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_98", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_98", "inbound_nodes": [[["add_44", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "DepthToSpace_5", "trainable": true, "dtype": "float32", "node_def": {"name": "DepthToSpace_5", "op": "DepthToSpace", "input": ["conv2d_98/Identity"], "attr": {"T": {"type": "DT_FLOAT"}, "block_size": {"i": "4"}, "data_format": {"s": "TkhXQw=="}}}, "constants": {}}, "name": "tf_op_layer_DepthToSpace_5", "inbound_nodes": [[["conv2d_98", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_5", "op": "Mul", "input": ["DepthToSpace_5", "Mul_5/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 127.5}}, "name": "tf_op_layer_Mul_5", "inbound_nodes": [[["tf_op_layer_DepthToSpace_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Add_45", "trainable": true, "dtype": "float32", "node_def": {"name": "Add_45", "op": "Add", "input": ["Mul_5", "Add_45/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [114.44400024414062, 111.46050262451172, 103.0199966430664]}}, "name": "tf_op_layer_Add_45", "inbound_nodes": [[["tf_op_layer_Mul_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Minimum_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Minimum_6", "op": "Minimum", "input": ["Add_45", "Minimum_6/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 255.0}}, "name": "tf_op_layer_Minimum_6", "inbound_nodes": [[["tf_op_layer_Add_45", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Maximum_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Maximum_6", "op": "Maximum", "input": ["Minimum_6", "Maximum_6/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.0}}, "name": "tf_op_layer_Maximum_6", "inbound_nodes": [[["tf_op_layer_Minimum_6", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0]], "output_layers": [["tf_op_layer_Maximum_6", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_88/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv2d_88/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_89/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_89/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_90/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_90/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_91/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_91/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_92/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_92/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_93/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_93/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_94/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_94/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_95/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_95/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_96/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_96/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_97/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_97/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_98/kernel", "shape": [3, 3, 64, 48], "dtype": "float32"}, {"name": "conv2d_98/bias", "shape": [48], "dtype": "float32"}]}]}