{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float16", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float16", "function": ["4wIAAAAAAAAAAgAAAAIAAABDAAAAcwwAAAB8AHwBGABkARsAUwApAk5nAAAAAADgX0CpACkC2gF4\n2ghyZ2JfbWVhbnIBAAAAcgEAAAD6HjxpcHl0aG9uLWlucHV0LTItZmQ5ZTU1MWM0NzM0PtoJbm9y\nbWFsaXplCgAAAHMCAAAAAAE=\n", [[114.44399999999999, 111.4605, 103.02000000000001]], null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float16"}, "name": "add", "inbound_nodes": [[["conv2d", 0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float16"}, "name": "add_1", "inbound_nodes": [[["add", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float16"}, "name": "add_2", "inbound_nodes": [[["add_1", 0, 0, {}], ["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_8", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float16"}, "name": "add_3", "inbound_nodes": [[["add_2", 0, 0, {}], ["conv2d_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float16", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float16"}, "name": "add_4", "inbound_nodes": [[["conv2d", 0, 0, {}], ["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float16", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_10", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float16", "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcw4AAAB0AGoBoAJ8AGQBoQJTACkCTukEAAAAKQPaAnRm2gJu\nbtoOZGVwdGhfdG9fc3BhY2UpAdoBeqkAcgYAAAD6HjxpcHl0aG9uLWlucHV0LTItZmQ5ZTU1MWM0\nNzM0PtoIPGxhbWJkYT4aAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float16", "function": ["4wIAAAAAAAAAAgAAAAIAAABDAAAAcwwAAAB8AGQBFAB8ARcAUwApAk5nAAAAAADgX0CpACkC2gF4\n2ghyZ2JfbWVhbnIBAAAAcgEAAAD6HjxpcHl0aG9uLWlucHV0LTItZmQ5ZTU1MWM0NzM0PtoLZGVu\nb3JtYWxpemUMAAAAcwIAAAAAAQ==\n", [[114.44399999999999, 111.4605, 103.02000000000001]], null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_2", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Minimum", "trainable": true, "dtype": "float16", "node_def": {"name": "Minimum", "op": "Minimum", "input": ["lambda_2/Identity", "Minimum/y"], "attr": {"T": {"type": "DT_HALF"}}}, "constants": {"1": 255.0}}, "name": "tf_op_layer_Minimum", "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Maximum", "trainable": true, "dtype": "float16", "node_def": {"name": "Maximum", "op": "Maximum", "input": ["Minimum", "Maximum/y"], "attr": {"T": {"type": "DT_HALF"}}}, "constants": {"1": 0.0}}, "name": "tf_op_layer_Maximum", "inbound_nodes": [[["tf_op_layer_Minimum", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["tf_op_layer_Maximum", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 64], "dtype": "float16"}, {"name": "conv2d/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_10/kernel", "shape": [3, 3, 64, 48], "dtype": "float16"}, {"name": "conv2d_10/bias", "shape": [48], "dtype": "float16"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_4/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_5/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_6/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_7/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_8/bias", "shape": [64], "dtype": "float16"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 64, 64], "dtype": "float16"}, {"name": "conv2d_9/bias", "shape": [64], "dtype": "float16"}]}]}